000001* HOST VARIABLES DEFINITIONS FOR SQL
000002  EXEC SQL BEGIN DECLARE SECTION END-EXEC.
000003*SQL実行状態の戻り値
000004 01 SQLSTATE     PIC X(5).
000005 01 SQLMSG       PIC X(255).
000006*郵便番号関連の集団項目（親）
000007 01 HOST-VARS.
000008     05 ZIPCODE-GROUP.
000009        10 ZIPCODE      PIC S9(7).
000010        10 ZIPCODE-PREF PIC X(2).
000011        10 ZIPCODE-CITY PIC X(20).
000012     05 ADDRESS-GROUP.
000013        10 ADDR-PREF    PIC N(4).
000014        10 ADDR-CITY    PIC X(20).
000015        10 ADDR-TOWN    PIC X(30).
000016     05 POSTAL-CODE    PIC X(8).
000017  EXEC SQL END DECLARE SECTION END-EXEC.
